# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSet..::..ReverseIterator Method
WireSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual WireSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As WireSetIterator
```

Visual C++
---
```text
public:
virtual WireSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
WireSet Class
Autodesk.Revit.DB.Electrical Namespace